ErBamboo/oh-my-robot-framework/platform/bsp/boards/lp-mspm0g3507/source/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  Generated once by TI SysConfig for LP_MSPM0G3507, then committed as a
 *  board-level BSP peripheral configuration asset (analogous to STM32's
 *  stm32f4xx_hal_conf.h).  Peripheral set: UART1/2, SPI1, TIMG6/7/8/12,
 *  TIMA0/1, GPIO, DMA, ADC0.
 *
 *  To regenerate: open empty.syscfg in CCS Theia SysConfig editor,
 *  modify as needed, and copy the output back here.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for UART_1 */
#define UART_1_INST                                                        UART1
#define UART_1_INST_FREQUENCY                                           32000000
#define UART_1_INST_IRQHandler                                  UART1_IRQHandler
#define UART_1_INST_INT_IRQN                                      UART1_INT_IRQn
#define GPIO_UART_1_RX_PORT                                                GPIOA
#define GPIO_UART_1_TX_PORT                                                GPIOA
#define GPIO_UART_1_RX_PIN                                         DL_GPIO_PIN_9
#define GPIO_UART_1_TX_PIN                                         DL_GPIO_PIN_8
#define GPIO_UART_1_IOMUX_RX                                     (IOMUX_PINCM20)
#define GPIO_UART_1_IOMUX_TX                                     (IOMUX_PINCM19)
#define GPIO_UART_1_IOMUX_RX_FUNC                      IOMUX_PINCM20_PF_UART1_RX
#define GPIO_UART_1_IOMUX_TX_FUNC                      IOMUX_PINCM19_PF_UART1_TX
#define UART_1_BAUD_RATE                                               (2000000)
#define UART_1_IBRD_32_MHZ_2000000_BAUD                                      (1)
#define UART_1_FBRD_32_MHZ_2000000_BAUD                                      (0)
/* Defines for UART_TJC */
#define UART_TJC_INST                                                      UART2
#define UART_TJC_INST_FREQUENCY                                         32000000
#define UART_TJC_INST_IRQHandler                                UART2_IRQHandler
#define UART_TJC_INST_INT_IRQN                                    UART2_INT_IRQn
#define GPIO_UART_TJC_RX_PORT                                              GPIOA
#define GPIO_UART_TJC_TX_PORT                                              GPIOA
#define GPIO_UART_TJC_RX_PIN                                      DL_GPIO_PIN_22
#define GPIO_UART_TJC_TX_PIN                                      DL_GPIO_PIN_21
#define GPIO_UART_TJC_IOMUX_RX                                   (IOMUX_PINCM47)
#define GPIO_UART_TJC_IOMUX_TX                                   (IOMUX_PINCM46)
#define GPIO_UART_TJC_IOMUX_RX_FUNC                    IOMUX_PINCM47_PF_UART2_RX
#define GPIO_UART_TJC_IOMUX_TX_FUNC                    IOMUX_PINCM46_PF_UART2_TX
#define UART_TJC_BAUD_RATE                                              (115200)
#define UART_TJC_IBRD_32_MHZ_115200_BAUD                                    (17)
#define UART_TJC_FBRD_32_MHZ_115200_BAUD                                    (23)




/* Defines for SPI_1 */
#define SPI_1_INST                                                         SPI1
#define SPI_1_INST_IRQHandler                                   SPI1_IRQHandler
#define SPI_1_INST_INT_IRQN                                       SPI1_INT_IRQn
#define GPIO_SPI_1_PICO_PORT                                              GPIOB
#define GPIO_SPI_1_PICO_PIN                                       DL_GPIO_PIN_8
#define GPIO_SPI_1_IOMUX_PICO                                   (IOMUX_PINCM25)
#define GPIO_SPI_1_IOMUX_PICO_FUNC                   IOMUX_PINCM25_PF_SPI1_PICO
#define GPIO_SPI_1_POCI_PORT                                              GPIOB
#define GPIO_SPI_1_POCI_PIN                                       DL_GPIO_PIN_7
#define GPIO_SPI_1_IOMUX_POCI                                   (IOMUX_PINCM24)
#define GPIO_SPI_1_IOMUX_POCI_FUNC                   IOMUX_PINCM24_PF_SPI1_POCI
/* GPIO configuration for SPI_1 */
#define GPIO_SPI_1_SCLK_PORT                                              GPIOB
#define GPIO_SPI_1_SCLK_PIN                                       DL_GPIO_PIN_9
#define GPIO_SPI_1_IOMUX_SCLK                                   (IOMUX_PINCM26)
#define GPIO_SPI_1_IOMUX_SCLK_FUNC                   IOMUX_PINCM26_PF_SPI1_SCLK
#define GPIO_SPI_1_CS0_PORT                                               GPIOB
#define GPIO_SPI_1_CS0_PIN                                        DL_GPIO_PIN_6
#define GPIO_SPI_1_IOMUX_CS0                                    (IOMUX_PINCM23)
#define GPIO_SPI_1_IOMUX_CS0_FUNC                     IOMUX_PINCM23_PF_SPI1_CS0



/* Port definition for Pin Group GPIO_LED */
#define GPIO_LED_PORT                                                    (GPIOA)

/* Defines for LED0_PA0: GPIOA.0 with pinCMx 1 on package pin 33 */
#define GPIO_LED_LED0_PA0_PIN                                    (DL_GPIO_PIN_0)
#define GPIO_LED_LED0_PA0_IOMUX                                   (IOMUX_PINCM1)
/* Port definition for Pin Group GPIO_CS */
#define GPIO_CS_PORT                                                     (GPIOB)

/* Defines for SPI_CS_PB5: GPIOB.5 with pinCMx 18 on package pin 53 */
#define GPIO_CS_SPI_CS_PB5_PIN                                   (DL_GPIO_PIN_5)
#define GPIO_CS_SPI_CS_PB5_IOMUX                                 (IOMUX_PINCM18)

/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_UART_1_init(void);
void SYSCFG_DL_UART_TJC_init(void);
void SYSCFG_DL_SPI_1_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
